name: "Unsupervised_TNet"
layer {
  name: "data"
  type: "PreGraspData"
  #top: "RGB"
  #top: "Depth"
  #top: "COM"
  top: "Position"
  include {
    phase: TRAIN
  }
  sp_unsupervised_data_param {
    batch_size: 200
    channels: 3
    height : 160
    width : 160
    data_path : "D:/PreGraspingData"
 
    data_limit : 200
  }
}
layer {
  name: "data"
  type: "PreGraspData"
  #top: "RGB"
  #top: "Depth"
  #top: "COM"
  top: "Position"
  include {
    phase: TEST
  }
  sp_unsupervised_data_param {
    batch_size: 1
    channels: 3
    height : 160
    width : 160
    data_path : "D:/PreGraspingData"
    data_limit : 1
  }
}
layer {
  name: "GMM"
  type: "GMM"
  bottom: "Position"
  top: "GMM"
  param {
    lr_mult: 1
    #decay_mult: 1
    decay_mult: 0
  }
  param {
    #lr_mult: 2
    lr_mult: 1
    decay_mult: 0
  }
  gmm_param{
	data_dim : 9
	class_size : 10
  }
  inner_product_param {
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "MDNLoss"
  type: "MDNLoss"
  bottom: "GMM"
  bottom: "Position"
  top: "l2_error"
  loss_weight: 1
  gmm_param{
	data_dim : 9
	class_size : 10
  }
}