name: "Unsupervised_TNet"
layer {
  name: "data"
  type: "PreGraspData"
  top: "RGB"
  top: "Depth"
  #top: "COM"
  top: "Position"
  include {
    phase: TRAIN
  }
  sp_unsupervised_data_param {
    batch_size: 200
    channels: 3
    height : 160
    width : 160
    data_path : "D:/PreGraspingData"
 
    data_limit : 200
  }
}
layer {
  name: "data"
  type: "PreGraspData"
  top: "RGB"
  top: "Depth"
 # top: "COM"
  top: "Position"
  include {
    phase: TEST
  }
  sp_unsupervised_data_param {
    batch_size: 1
    channels: 3
    height : 160
    width : 160
    data_path : "D:/PreGraspingData"
    data_limit : 1
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "RGB"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 2
    #visualize: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    #visualize: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    #visualize: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "spatial"
  type: "Spatial"
  bottom: "conv3"
  bottom: "RGB"
  top: "spatial1"
  spatial_param{
	alpha: 4
  }
}
layer {
  name: "depth_concat"
  type: "DepthConcat"
  bottom: "spatial1"
  bottom: "Depth"
  top: "Depthconcat"
}
layer {
  name: "crumple1"
  type: "Crumple"
  bottom: "Depthconcat"
  top: "Depthconcat_crumple"
  crumple_param{
	mode: 1
	size : 3
  }
}
##############Transformation network####################
#fix this network
layer {
  name: "uvd_xyz_fc1"
  type: "InnerProduct"
  bottom: "Depthconcat_crumple"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn1"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
     use_global_stats : true
  }
}
layer {
  name: "uvd_xyz_relu1"
  type: "ReLU"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
}
layer {
  name: "uvd_xyz_fc2"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn2"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
     use_global_stats : true;
  }
}
layer {
  name: "uvd_xyz_relu2"
  type: "ReLU"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
}
layer {
  name: "uvd_xyz_fc3"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "xyz_xyz_robot"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc3"
  top: "xyz_robot"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
##############################
layer {
  name: "crumple2"
  type: "Crumple"
  bottom: "xyz_robot"
  top: "XYZ_robot_crumple"
  crumple_param{
	mode: 2
	size : 192
  }
}
layer {
  name: "fc_pregrasp1"
  type: "InnerProduct"
  bottom: "XYZ_robot_crumple"
  top: "fc_pregrasp1"
  param {
    lr_mult: 1
    #decay_mult: 1
    decay_mult: 0
  }
  param {
    #lr_mult: 2
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 192
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu_pregrasp1"
  type: "ReLU"
  bottom: "fc_pregrasp1"
  top: "fc_pregrasp1"
}
layer {
  name: "fc_pregrasp2"
  type: "InnerProduct"
  bottom: "fc_pregrasp1"
  top: "fc_pregrasp2"
  param {
    lr_mult: 1
    #decay_mult: 1
    decay_mult: 0
  }
  param {
    #lr_mult: 2
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 192
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu_pregrasp2"
  type: "ReLU"
  bottom: "fc_pregrasp2"
  top: "fc_pregrasp2"
}

layer {
  name: "fc_pregrasp3"
  type: "InnerProduct"
  bottom: "fc_pregrasp2"
  top: "fc_pregrasp3"
  param {
    lr_mult: 1
    #decay_mult: 1
    decay_mult: 0
  }
  param {
    #lr_mult: 2
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 192
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "GMM"
  type: "GMM"
  bottom: "fc_pregrasp3"
  top: "GMM"
  param {
    lr_mult: 1
    #decay_mult: 1
    decay_mult: 0
  }
  param {
    #lr_mult: 2
    lr_mult: 1
    decay_mult: 0
  }
  gmm_param{
	data_dim : 9
	class_size : 10
  }
  inner_product_param {
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "MDNLoss"
  type: "MDNLoss"
  bottom: "GMM"
  bottom: "Position"
  top: "l2_error"
  loss_weight: 1
  gmm_param{
	data_dim : 9
	class_size : 10
  }
}