name: "uvd_xyz_net"
layer {
  name: "data"
  type: "UVDXYZData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  sp_unsupervised_data_param {
    batch_size: 183
    data_path : "./UVD_XYZ_net/uvd_xyz_final(2016.03.31)/uvd_XYZ_robot_train.bin"
  }
}
layer {
  name: "data"
  type: "UVDXYZData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  sp_unsupervised_data_param {
   batch_size: 10
   data_path : "./UVD_XYZ_net/uvd_xyz_final(2016.03.31)/uvd_XYZ_robot_train.bin"
  }
}
layer {
  name: "uvd_xyz_fc1"
  type: "InnerProduct"
  bottom: "data"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn1"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
batch_norm_param{
     use_global_stats : true;
  }

}
layer {
  name: "uvd_xyz_relu1"
  type: "ReLU"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
}
layer {
  name: "uvd_xyz_fc2"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn2"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param{
     use_global_stats : true;
  }

}
layer {
  name: "uvd_xyz_relu2"
  type: "ReLU"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
}
layer {
  name: "uvd_xyz_fc3"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "xyz_xyz_robot"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc3"
  top: "xyz_robot"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "distance"
  type: "EuclideanDist"
  bottom: "xyz_robot"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "xyz_robot"
  bottom: "label"
  top: "l2_error"
}