name: "uvd_xyz_net"
layer {
  name: "data"
  type: "UVDXYZData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  sp_unsupervised_data_param {
    batch_size: 7500
    data_path : "./UVD_XYZ_net/uvd_xyz_rgb_frame_obj_train.bin"
  }
}
layer {
  name: "data"
  type: "UVDXYZData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  sp_unsupervised_data_param {
   batch_size: 930
   data_path : "./UVD_XYZ_net/uvd_xyz_rgb_frame_obj_test.bin"
  }
}
layer {
  name: "uvd_xyz_fc1"
  type: "InnerProduct"
  bottom: "data"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 800
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn1"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "uvd_xyz_relu1"
  type: "ReLU"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc1"
}
layer {
  name: "uvd_xyz_fc2"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc1"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 800
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn2"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "uvd_xyz_relu2"
  type: "ReLU"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc2"
}
layer {
  name: "uvd_xyz_fc3"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc2"
  top: "uvd_xyz_fc3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 800
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "uvd_xyz_bn3"
  type: "BatchNorm"
  bottom: "uvd_xyz_fc3"
  top: "uvd_xyz_fc3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "uvd_xyz_relu3"
  type: "ReLU"
  bottom: "uvd_xyz_fc3"
  top: "uvd_xyz_fc3"
}
layer {
  name: "uvd_xyz_fc4"
  type: "InnerProduct"
  bottom: "uvd_xyz_fc3"
  top: "uvd_xyz_fc4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 192
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "distance"
  type: "EuclideanDist"
  bottom: "uvd_xyz_fc4"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "uvd_xyz_fc4"
  bottom: "label"
  top: "l2_error"
}